app/controllers/playlists_controller.rb

INSERT INTO "playlists" ("name", "artist", "duration", "fav", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tell Me U Luv Me"], ["artist", "Juice WRLD"], ["duration", "4:23"], ["fav", true], ["created_at", "2020-08-07 01:39:47.236420"], ["updated_at", "2020-08-07 01:39:47.236420"]]
---
  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save

UPDATE "playlists" SET "name" = $1, "artist" = $2, "duration" = $3, "fav" = $4, "updated_at" = $5 WHERE "playlists"."id" = $6  [["name", "Flowers in December"], ["artist", "Mazzy Star"], ["duration", "4:23"], ["fav", true], ["updated_at", "2020-08-07 03:07:55.241098"], ["id", 57]]
---
  def update
    if @playlist.update(playlist_params)

DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 47]]
---
  def destroy
    @playlist.destroy

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_playlist
      @playlist = Playlist.find(params[:id])